src/soap/MantisConnectBinding.mc_project_attachment_add.req.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope
 xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
 xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/"
 xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
 xmlns:xsd="http://www.w3.org/2001/XMLSchema"
 xmlns:ns1="http://futureware.biz/mantisconnect">
 <SOAP-ENV:Body SOAP-ENV:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/">
  <ns1:mc_project_attachment_add>
   <username></username>
   <password></password>
   <project_id></project_id>
   <name></name>
   <title></title>
   <description></description>
   <file_type></file_type>
   <content></content>
  </ns1:mc_project_attachment_add>
 </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
